music_app/app/controllers/albums_controller.rb

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "albums" ("studio_album?", "band_id", "title", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["studio_album?", true], ["band_id", 3], ["title", "another album"], ["year", "2022-09-14"], ["created_at", "2022-09-20 23:25:32.901459"], ["updated_at", "2022-09-20 23:25:32.901459"]]
---
    def create

       @album = Album.new(album_params)
        @band = Band.find_by(id: params[:album][:band_id])
        if @album && @album.save