music_app/app/controllers/application_controller.rb

    def set_band
        @band = Band.find_by(id: params[:id])
---
SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]