music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test 2"], ["created_at", "2022-09-20 20:56:05.978618"], ["updated_at", "2022-09-20 20:56:05.978618"]]
---
    def create
        @band = Band.new(band_params)
        if @band && @band.save

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1 LIMIT $2  [["band_id", 3], ["LIMIT", 1]]
---
    def show
        @albums = Album.where(band_id: @band.id)

DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]
---
    def destroy

        if @band && @band.destroy