music_app/app/controllers/sessions_controller.rb

    def create
        @user = User.find_by_credentials(params[:user][:email], params[:user][:password])
        if @user && @user.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2022-09-20 18:21:04.291247"], ["id", 1]]