music_app/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        if logged_in?
            @user = User.find_by(id: params[:id])

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "test@gmail.com"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"], ["created_at", "2022-09-20 18:04:28.756770"], ["updated_at", "2022-09-20 18:04:28.756770"]]
---
    def create
        @user = User.new(user_params)
        if @user && @user.save